<a href="https://colab.research.google.com/github/SparkyGoLarky/SparkyGoLarky/blob/main/Crypto_stock_data_with_Python_SQLite.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
data = pd.read_csv("ETH.csv")
data.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2022-01-01,3683.047119,3769.917969,3682.286621,3769.697021,3769.697021,9776191466
1,2022-01-02,3769.298340,3836.161865,3727.357422,3829.564941,3829.564941,9881471548
2,2022-01-03,3829.535645,3836.198730,3698.047607,3761.380371,3761.380371,12080777893
3,2022-01-04,3761.361572,3876.785156,3723.349854,3794.056641,3794.056641,14030925983
4,2022-01-05,3794.269043,3842.059814,3456.745361,3550.386963,3550.386963,18061338502

In [2]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       365 non-null    object
 1   Open       365 non-null    float64
 2   High       365 non-null    float64
 3   Low        365 non-null    float64
 4   Close      365 non-null    float64
 5   Adj Close  365 non-null    float64
 6   Volume     365 non-null    int64
dtypes: float64(5), int64(1), object(1)
memory usage: 20.1+ KB

In [3]:
import sqlite3
connection = sqlite3.connect("eth.db")
data.to_sql("Eth", connection, if_exists='replace')

365

In [4]:
result = connection.execute("SELECT name FROM sqlite_master WHERE type='table';")
for name in result:
  print(name[0])

Eth

In [7]:
%load_ext sql

In [8]:
%sql sqlite:///eth.db

In [10]:
%sql SELECT sql FROM sqlite_master WHERE type='table'

 * sqlite:///eth.db
Done.

[('CREATE TABLE "Eth" (\n"index" INTEGER,\n  "Date" TEXT,\n  "Open" REAL,\n  "High" REAL,\n  "Low" REAL,\n  "Close" REAL,\n  "Adj Close" REAL,\n  "Volume" INTEGER\n)',)]

In [13]:
%sql SELECT * FROM Eth LIMIT 5;

 * sqlite:///eth.db
Done.

[(0, '2022-01-01', 3683.047119140625, 3769.91796875, 3682.28662109375, 3769.697021484375, 3769.697021484375, 9776191466),
 (1, '2022-01-02', 3769.29833984375, 3836.161865234375, 3727.357421875, 3829.56494140625, 3829.56494140625, 9881471548),
 (2, '2022-01-03', 3829.53564453125, 3836.19873046875, 3698.047607421875, 3761.38037109375, 3761.38037109375, 12080777893),
 (3, '2022-01-04', 3761.361572265625, 3876.78515625, 3723.349853515625, 3794.056640625, 3794.056640625, 14030925983),
 (4, '2022-01-05', 3794.26904296875, 3842.059814453125, 3456.745361328125, 3550.386962890625, 3550.386962890625, 18061338502)]

In [14]:
%sql SELECT COUNT(*) FROM Eth;

 * sqlite:///eth.db
Done.

[(365,)]

In [16]:
%sql SELECT SUM("Volume") AS Total_Trades FROM Eth;

 * sqlite:///eth.db
Done.

[(5586527528916,)]

In [17]:
%sql SELECT AVG("Close") AS Average_Close FROM Eth;

 * sqlite:///eth.db
Done.

[(1987.3931869715861,)]

In [33]:
%sql SELECT Date, ROUND(SUM("Volume" * "Adj Close"), 2) AS Market_Cap FROM Eth LIMIT 5;

 * sqlite:///eth.db
Done.

[('2022-01-01', 1.1337350512267532e+16)]

In [31]:
%%sql
SELECT strftime('%Y', Date) AS Year, COUNT(*) AS Yearly_Trades
FROM Eth
GROUP BY Year;

 * sqlite:///eth.db
Done.

[('2022', 365)]

In [36]:
%%sql
SELECT strftime('%Y', Date) AS Year, COUNT(*) as Trades, ROUND("Close"/SUM("Close") * 100, 2) AS Change_Percentage
FROM Eth
GROUP BY Year;

 * sqlite:///eth.db
Done.

[('2022', 365, 0.52)]

In [43]:
%%sql
SELECT strftime('%Y', Date) AS Year, ROUND(((Close - Open) / Open) * 100, 2) || '%' AS Change_Percentage
FROM Eth
GROUP BY Year;

 * sqlite:///eth.db
Done.

[('2022', '2.35%')]

In [46]:
%sql SELECT MAX("High"), MIN("Low") FROM Eth;

 * sqlite:///eth.db
Done.

[(3876.78515625, 896.1090087890625)]

In [48]:
%%sql
SELECT strftime('%m', Date) AS Month, ROUND(High, 2) AS High, ROUND(Low, 2) AS Low
FROM Eth
GROUP BY Month;

 * sqlite:///eth.db
Done.

[('01', 3769.92, 3682.29),
 ('02', 2802.32, 2682.62),
 ('03', 3029.65, 2868.94),
 ('04', 3467.56, 3223.89),
 ('05', 2838.7, 2728.08),
 ('06', 1965.17, 1776.05),
 ('07', 1100.22, 1040.15),
 ('08', 1700.17, 1613.42),
 ('09', 1593.08, 1520.19),
 ('10', 1332.52, 1306.1),
 ('11', 1606.61, 1568.1),
 ('12', 1296.0, 1267.71)]